
structure_menu = {
    "Основное меню": {
        "📋 Каталоги товаров и цен": "Каталоги товаров и цен",
        "📦 Закупка оптом": {
            "Проекторы": {
                "Everycom": [
                    "Rondo",
                    "Cabulite max",
                    "Cabulite mini",
                    "HQ9W ultra(HQ10W)",
                    "YG628 ULtra",
                    "HY300PRO(Genunine)",
                    "A10",
                    "K1",
                    "K2",
                    "C1",
                    "P30",
                    "HY320",
                    "H50",
                    "H5PRO",
                    "X30wpro",
                    "H6 PRO",
                    "H6 MAX",
                    "Q10W Max",
                    "RD828W",
                    "E700 PRO",
                    "E700 2K MAX"
                ],
                "Dangei": [
                    "Mars pro 2"
                ],
                "Formovie":[
                    "Theater Premium LaserTV"
                ],
                "AWOL":[
                    "LTV-3000pro",
                    "LTV-3500pro"
                ],
                "Экраны": [
                                "Настенный электр.",
                                "Настенный механ.",
                                "На штативе",
                                "Напольный(UST)",
                                "Настенный(UST)"
                                ],
                "💰 Каталог(Проекторы)":''
            },
            "Barcode сканеры": {
                "DYscan": [
                    "DI series",
                    "DS series",
                    "DF series",
                    "DP series",
                    "DE series"
                ],
                "💰 Каталог(Сканеры)":""
                        },
            "Чехлы и кейсы": {
                "XUNDD": [
                    "New case series",
                    "Fold & Flip Case",
                    "Magnetic With Holder Case",
                    "Magnetic Case",
                    "Beatle 1",
                    "Beatle 2",
                    "Other Case",
                    "iPad Cover",
                    "Keyboard Cover"
                ]

            },
            "Блоки зарядки": {
                "XUNDD": [
                    "XDCH-series"
                ],
                "BAVIN": [
                    "PC series",
                    "💰 Каталог(PC)"
                ]
            },
            "Кабели": {
                "XUNDD": [
                    "XDDC-series"
                ],
                "BAVIN": [
                    "CB series",
                    "💰 Каталог(CB)"
                ]

            },
            "Умные часы": {
                "XUNDD": [
                    "SW002",
                    "SW001"
                ]
            },
            "Сетевые фильтры": {
                "BAVIN": [
                    "PC512",
                    "PC588",
                    "PC589",
                    "PC803-EU",
                    "PC825",
                    "PC823Y-EU",
                    "PC830Y",
                    "PC830E",
                    "PC833Y",
                    "PC2026",
                    "PC2026Y",
                    "PC2026E",
                    "PC2080",
                    "PC2081",
                    "PC2082"
                ],
                "💰 Каталог(СФ)":''
            },
            "GPU (графические процессоры)": {
                "Nvidia": [
                    "A4000",
                    "A6000E",
                    "RTX6000 ADA",
                    "H100 80G",
                    "H100 NVL 94G",
                    "H200 NVL 141G"
                ]
            },
            "Материнские платы": {
                "Supermicro motherboard": [
                    "X10 DAI",
                    "X11SSL-F",
                    "X11SPL-F",
                    "X11SSM-F",
                    "X11DPI-N",
                ]
            },
            "CPU (центральные процессоры)": {
                "AMD": [
                    "AMD 7713"
                ]
            },
            "HDD (жесткие диски)": {
                "Seagate HDD": [
                    "ST8000NM017B",
                    "ST10000NM017B",
                    "ST10000NM018B",
                    "ST16000NM000J",
                    "ST16000NM004J",
                    "ST18000NM000J",
                    "ST18000NM004J",
                    "ST20000NM007D",
                    "ST20000NM002H",
                    "ST600MM0009",
                    "ST1800MM0129",
                    "ST2400MM0129"
                ]
            },
            "Беспроводные наушники": {
                "XUNDD": [
                    "B series",
                    "D series",
                    "H series",
                    "W series",
                    "X series"
                ],
                "BAVIN": [
                    "BH series",
                    "BAVIN series",
                    "MP series",
                    "💰 Каталог(BH,MP)"
                ]


            },
            "Аудио аксессуары": {
                "BAVIN": [
                    "AUX series",
                    "HX series",
                ],
                "💰 Каталог(аудио)":""
            },
            "Зарядки в авто": {
                "XUNDD": [
                    "XDCC series",
                    "XDCH series"
                ],
                "BAVIN": [
                    "PC-series",
                    "💰 Каталог(авто)"
                ],

            },
            "Держатели/подставки устройств": {
                "XUNDD": [
                    "A series",
                    "Mikko series",
                    "XDHO series"
                ],
                "BAVIN": [
                    "AP series",
                    "CA series",
                    "D-SPS series",
                    "DS series",
                    "PC series",
                    "PS series",
                    "💰 Каталог(подставки)"
                ]

            },
            "Powerbanks/станции питания": {
                "XUNDD": [
                    "XDPB-series",
                    "XDCH-series"
                ],
                "BAVIN":[
                    "BST series",
                    "PC series",
                    "💰 Каталог(повербанки)"
                ]
            },
            "Беспроводные зарядки": {
                "BAVIN": [
                    "PC017",
                    "PC832Y",
                    "PC832E",
                    "PC962",
                    "PC1033",
                    "PC1065",
                    "PC1069",
                    "PC1071",
                    "PC1129",
                    "PC2021",
                    "PC2032",
                    "💰 Каталог(зарядки)"
                ],
            },
            "OTG/Хабы/кардридеры":{
                "BAVIN": [
                    "HUB series",
                    "OTG series"
                ],
                "💰 Каталог(хабы)":""
            }
            },
        "🚚 Вопросы по логистике": "Вопросы по логистике",
        "💰 Вопросы по оплате": "Вопросы по оплате",
        "👨🏻‍💻 Чат с администратором": "Чат с администратором",
        "❓ Как пользоваться": "❓ Как пользоваться",
        "ℹ️ О нас": "О нас"
    }

    }

HELP_TEXT = """
📖 **Как пользоваться ботом**

Добро пожаловать!  
Мы занимаемся **логистикой оптовых партий товаров с заводов Китая**, а также предлагаем **широкий ассортимент электроники и не только** по **низким ценам**.

---

🔽 **Как начать:**

1. **📋 Каталоги товаров и цен**  
Получите доступ к полному списку товаров и актуальным ценам. Ознакомьтесь с каталогами и выберите понравившиеся позиции.
Каталоги представлены в виде ссылок на гугл таблицы.

2. **📦 Закупка оптом**  
После выбора товара из каталога с помощью подразделов в меню:
- выберите категорию товара,  
- укажите бренд и модель,  
- добавьте примерное количество.  
Мы получим вашу заявку, и администратор свяжется с вами в ближайшее время для уточнения деталей.

3. **👨🏻‍💻 Чат с администратором**  
Хотите задать вопрос напрямую? Используйте эту кнопку, чтобы сразу перейти в чат с админом.

---

ℹ️ **Дополнительные разделы:**

- **🚚 Вопросы по логистике** — вся информация по доставке.  
- **💰 Вопросы по оплате** — всё об условиях и способах оплаты.

---

🤖 **Встроенный AI-ассистент**

Бот оснащён **AI-ассистентом**, который ответит на ваши вопросы прямо в чате. Просто отправьте сообщение — он поможет!

---

🚨 **Обратите внимание!**  
В боте работает **антиспам-система**.  
Чтобы бот работал стабильно, количество действий одного пользователя ограничено.
"""
